app/serializers/merchant_serializer.rb

  def item_count
    object.items.count
---
SELECT COUNT(*) FROM "items" WHERE "items"."merchant_id" = $1  [["merchant_id", 55]]