app/controllers/api/v1/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    items = if params[:sorted] == 'price'
      Item.sorted_by_price
    else
      Item.all

INSERT INTO "items" ("name", "description", "unit_price", "merchant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
      item = Item.create!(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "unit_price" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["unit_price", 65.23], ["updated_at", "2024-11-06 04:08:30.003986"], ["id", 179]]
---
  def update
    item = Item.find(params[:id])
    if item.update!(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 99999], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2517]]
---
  def destroy
    item = Item.find(params[:id])
    item.destroy

SELECT "items".* FROM "items" WHERE (unit_price >= 50.0 AND unit_price <= 150.0) ORDER BY "items"."name" ASC LIMIT $1  [["LIMIT", 1]]
---
  def find_all
    if params[:min_price].present? || params[:max_price].present?
      items = Item.find_items_by_price(params.slice(:min_price, :max_price))
    elsif params[:name].present?
      items = Item.find_items_by_name(params[:name])