app/controllers/api/v1/items_merchant_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 209], ["LIMIT", 1]]
---
  def index

    item = Item.find(params[:id])