app/controllers/api/v1/merchants_controller.rb

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."merchant_id" = $1  [["merchant_id", 34]]
---
    def show
        merchant = Merchant.with_item_count.find(params[:id])

INSERT INTO "merchants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "null"], ["created_at", "2024-11-03 17:46:50.097137"], ["updated_at", "2024-11-03 17:46:50.097137"]]
---
    def create
        merchant = Merchant.create!(merchant_params)

UPDATE "merchants" SET "name" = $1, "updated_at" = $2 WHERE "merchants"."id" = $3  [["name", "Merchant New and Improved"], ["updated_at", "2024-11-04 20:30:50.517316"], ["id", 4]]
---
    def update
        render json: Merchant.update(params[:id], merchant_params)

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "merchants" WHERE "merchants"."id" = $1  [["id", 132]]
---
    def destroy
        merchant = Merchant.find(params[:id])
        merchant.destroy

SELECT "merchants".* FROM "merchants" WHERE (name ILIKE '%a%') ORDER BY "merchants"."name" ASC
---
    def find
        if params[:name].present?
            merchant = Merchant.find_merchant_by_name(params)