app/controllers/api/v1/merchant_items_controller.rb

  def index
    merchant = Merchant.find(params[:id])
---
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 99], ["LIMIT", 1]]