app/controllers/api/v1/merchants_customers_controller.rb

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def index
    merchant = Merchant.find(params[:merchant_id])