app/models/item.rb

  def self.search_params(params)
    result = {}

    if params[:min_price].present? && params[:min_price].to_f < 0
      result[:errors] = [{ detail: 'Price cannot be less than zero.' }]
      return result
    elsif params[:max_price].present? && params[:max_price].to_f < 0
      result[:errors] = [{ detail: 'Price cannot be less than zero.' }]
      return result
    elsif params[:min_price].present? && params[:name].present?
      result[:errors] = [{ detail: 'Cannot filter by both price and name at the same time.' }]
      return result
    elsif params[:max_price].present? && params[:name].present?
---
SELECT "items".* FROM "items" WHERE (unit_price >= 50.0 AND unit_price <= 150.0) ORDER BY "items"."name" ASC LIMIT $1  [["LIMIT", 1]]